# FillPatternIdParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FillPatternIdParam Property
ParameterTypeId Class See Also
---
"Cut fill pattern"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FillPatternIdParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FillPatternIdParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FillPatternIdParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace